Autodesk.Revit.DB.Structure.RebarHostData.SetCommonCoverType(Autodesk.Revit.DB.Structure.RebarCoverType)
Associate a single CoverType with all exposed faces of the host element.
coverType:
A CoverType object to be applied to all faces.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2012

Autodesk.Revit.DB.Structure.RebarHostData.SetCoverType(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Structure.RebarCoverType)
Associates the specified CoverType with the specified face of the element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
In this element, face does not have an associated CoverType, because
it is not exposed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.

Autodesk.Revit.DB.Structure.RebarHostData.GetRebarHostData(Autodesk.Revit.DB.Element)
Gets a RebarHostData object referring to the specified
rebar host element.
Remarks:
Returns null for elements that cannot ever be rebar hosts,
such as levels.
host:
An element to host rebar.
Returns:
A RebarHostData object, or null.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.